class TeamDecorator < ApplicationDecorator
  delegate_all

  def thumbnail
    object.thumbnail.presence || 'team_thumbnail_default.jpg'
  end

  def self.options_for_select
    [
      ['ゴリラ', 10],
      ['ワニ', 20],
      ['トナカイ', 30],
      ['ゾウ', 40],
      ['ワオキツネザル', 50],
      ['サイ', 60],
      ['オオアリクイ', 70],
      ['オランウータン', 80],
      ['パンダ', 90],
      ['レッサーパンダ', 100],
      ['コアラ', 110],
      ['トラ', 120],
      ['カワウソ', 130],
      ['マレーバク', 140],
      ['ラッコ', 150],
      ['ジュゴン', 160],
      ['ジンベイザメ', 170],
      ['セイウチ', 180],
      ['シロナガスクジラ', 190],
      ['シロクマ', 200]
    ]
  end

  def self.options_for_search
    [
      ['ゴリラ(10時間)', 10],
      ['ワニ(20時間)', 20],
      ['トナカイ(30時間)', 30],
      ['ゾウ(40時間)', 40],
      ['ワオキツネザル(50時間)', 50],
      ['サイ(60時間)', 60],
      ['オオアリクイ(70時間)', 70],
      ['オランウータン(80時間)', 80],
      ['パンダ(90時間)', 90],
      ['レッサーパンダ(100時間)', 100],
      ['コアラ(110時間)', 110],
      ['トラ(120時間)', 120],
      ['カワウソ(130時間)', 130],
      ['マレーバク(140時間)', 140],
      ['ラッコ(150時間)', 150],
      ['ジュゴン(160時間)', 160],
      ['ジンベイザメ(170時間)', 170],
      ['セイウチ(180時間)', 180],
      ['シロナガスクジラ(190時間)', 190],
      ['シロクマ(200時間)', 200]
    ]
  end
end
